# Drop row or column

In [39]:
import pandas as pd

friends = [{'age': 20, 'job': 'student'},
         {'age': 30, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]

df = pd.DataFrame(friends, index = ['John', 'Jenny', 'Nate'],
                 columns = ['age', 'job'])

In [40]:
df

       age        job
John    20    student
Jenny   30  developer
Nate    30    teacher

In [41]:
# if index value in ['John', 'Nate']  then DataFrame row drop
df.drop(['John', 'Nate'])

       age        job
Jenny   30  developer

In [42]:
# immutable (return DataFrame)
df = df.drop(['John', 'Nate'])

In [43]:
df

       age        job
Jenny   30  developer

In [44]:
df = pd.DataFrame(friends, index = ['John', 'Jenny', 'Nate'],
                 columns = ['age', 'job'])

In [45]:
df

       age        job
John    20    student
Jenny   30  developer
Nate    30    teacher

In [46]:
# replace DataFrame(mutable)
df.drop(['John', 'Nate'], inplace = True)

In [47]:
df

       age        job
Jenny   30  developer

In [48]:
friends =  [{'name': 'Jone', 'age': 15, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': None},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]

df = pd.DataFrame(friends, 
                 columns = ['name', 'age', 'job'])

In [49]:
df

    name  age      job
0   Jone   15  student
1  Jenny   30     None
2   Nate   30  teacher

In [50]:
# if index number in [0, 2]  then DataFrame row drop
df = df.drop(df.index[[0,2]])

In [51]:
df

    name  age   job
1  Jenny   30  None

In [52]:
df = pd.DataFrame(friends, 
                 columns = ['name', 'age', 'job'])

In [53]:
# It is return That DataFrame age column value greater than 20 
df = df[df.age > 20]

In [54]:
df

    name  age      job
1  Jenny   30     None
2   Nate   30  teacher

In [55]:
# it is drop column
df = pd.DataFrame(friends, 
                 columns = ['name', 'age', 'job'])
# axis=1 : column
df = df.drop('age', axis=1)
df

    name      job
0   Jone  student
1  Jenny     None
2   Nate  teacher

In [56]:
# it is drop column
df = pd.DataFrame(friends, 
                 columns = ['name', 'age', 'job'])

df.drop('age', axis=1, inplace = True)

df

    name      job
0   Jone  student
1  Jenny     None
2   Nate  teacher